package variable;

public class Var6 {
    // 정수
    byte b = 127; //-128 ~ 127
    short s = 32767; // -32,768 ~ 32,767
    int i = 2147483647; //-2,147,483,648 ~ 2,147,483,647 (약 20억) // 거의 int 사용

    //-9,223,372,036,854,775,808 ~ 9,223,372,036,854,775,807
    // 뒤에 L을 붙여줘야 한다
    long l = 9223372036854775807L;

    //실수
    float f = 10.0f;
    double d = 10.0; // 거의 double 사용

/*  자주 사용하는 타입**
    실무에서 자주 사용하는 타입은 다음과 같다.
    정수 - `int` , `long` : 자바는 정수에 기본으로 `int` 를 사용한다. 만약 20억이 넘을 것 같으면 `long` 을 쓰면 된다.
    파일을 다룰 때는 `byte` 를 사용한다.
    실수 - `double` : 실수는 고민하지 말고 `double` 을 쓰면 된다.
            불린형 - `boolean` : `true` , `false` 참 거짓을 표현한다. 이후 조건문에서 자주 사용된다.
    문자열 - `String` : 문자를 다룰 때는 문자 하나든 문자열이든 모두 `String` 을 사용하는 것이 편리하다.
    자주 사용하는 타입을 제외하고 실무에서 나머지를 사용하는 경우는 거의 없다. 그나마 파일 전송시에 `byte` 를 사용한다.*/
}
